Update1C/ВыгрузкаФайловКонфигурации/Catalogs/Прокси.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Прокси</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Использован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьSocks4</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьSocks5</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьSSL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задержка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтраны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Работает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Update1C/ВыгрузкаФайловКонфигурации/Catalogs/Прокси/Ext/ManagerModule.bsl
Функция ПолучитьПоказатели() ЭКспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Прокси.Ссылка КАК Ссылка,
	|	Прокси.Использован КАК Использован,
	|	Прокси.Работает КАК Работает,
	|	Прокси.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.Прокси КАК Прокси";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Всего 			= РезультатЗапроса.НайтиСтроки(Новый Структура("ПометкаУдаления", Ложь)).Количество();
	Заблокированных = РезультатЗапроса.НайтиСтроки(Новый Структура("ПометкаУдаления, Работает", Ложь, Ложь)).Количество();
	Использованных  = РезультатЗапроса.НайтиСтроки(Новый Структура("ПометкаУдаления, Работает, Использован", Ложь, Истина, Истина)).Количество();
	Работает  		= РезультатЗапроса.НайтиСтроки(Новый Структура("ПометкаУдаления, Работает, Использован", Ложь, Истина, Ложь)).Количество();

	Структура = Новый Структура;
	
	Структура.Вставить("Всего", 			Всего);
	Структура.Вставить("Заблокированных", 	Заблокированных);
	Структура.Вставить("Использованных", 	Использованных);
	Структура.Вставить("Работает", 			Работает);

	Возврат Структура;
	
КонецФункции

Процедура Очистить_ПереченьПрокси() Экспорт
	
	ОМ_Прокси.Очистить_ПереченьПрокси();
	
КонецПроцедуры

Функция КоличествоЭлементовПрокси() Экспорт
	
	Возврат ОМ_Прокси.Получить_ПереченьПрокси(Истина).Количество();
	
КонецФункции
